# 绘制散点图
# 现有3月和10月每天白天的最高气温，如何寻找气温随天数变化的某种规则
# 3月：[11,17,16,11,12,11,12,6,6,7,8,9,12,15,14,17,18,21,16,17,20,14,15,15,15,19,21,22,22,22,23]
# 10月：[26,26,28,19,21,17,16,19,18,20,20,19,22,23,17,20,22,15,11,15,5,13,17,10,11,13,12,13,6]
from matplotlib import pyplot as plt


x_3 = range(1, 32)
x_10 = range(41, 72)
y_3 = [
    11, 17, 16, 11, 12, 11, 12, 6, 6, 7, 8, 9, 12, 15, 14, 17, 18, 21, 16, 17,
    20, 14, 15, 15, 15, 19, 21, 22, 22, 22, 23]
y_10 = [
    26, 26, 28, 19, 21, 17, 16, 19, 18, 20, 20, 19, 22, 23, 17, 20, 22, 15, 11,
    15, 5, 13, 17, 10, 11, 13, 12, 13, 6, 5, 6]

plt.figure(figsize=(15, 8), dpi=80)

# 绘制散点图
plt.scatter(x_3, y_3, label="3月份")
plt.scatter(x_10, y_10, label="10月份")

# 调整x轴的刻度
_x = list(x_3)+list(x_10)
_x_label = ["3月{}日".format(i) for i in range(1, 32)]
_x_label += ["10月{}日".format(i) for i in range(1, 32)]
plt.xticks(_x[::2], _x_label[::2], rotation=45)

# 添加图例
plt.legend(loc="upper left")

# 添加说明
plt.xlabel("日期")
plt.ylabel("温度 单位（℃）")
plt.title("3月和10月每天白天的最高气温散点图")

# 可显示中文
plt.rcParams['font.sans-serif'] = "SimHei"
# 显示
plt.show()
